# IsMergedPart Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PartUtils..::..IsMergedPart Method
PartUtils Class See Also
---
Is the Part the result of a merge.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public static bool IsMergedPart(
	Part part
)
```

Visual Basic
---
```text
Public Shared Function IsMergedPart ( _
	part As Part _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsMergedPart(
	Part^ part
)
```

# ### Parameters
part
    Type: Autodesk.Revit.DB..::..Part
# ### Return Value
True if the Part is the result of a merge operation.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PartUtils Class
Autodesk.Revit.DB Namespace